ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ckcu.c
/*********************************************************************************************************//**
 * @file    ht32l5xxxx_ckcu.c
 * @version $Rev:: 460          $
 * @date    $Date:: 2024-07-11 #$
 * @brief   This file provides all the Clock Control Unit firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32l5xxxx_ckcu.h"

/** @addtogroup HT32L5xxxx_Peripheral_Driver HT32L5xxxx Peripheral Driver
  * @{
  */

/** @defgroup CKCU CKCU
  * @brief CKCU driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Private_Define CKCU private definitions
  * @{
  */

/* GCFGR bit field definition                                                                               */
#define CKCU_POS_CKOUTSRC       0
#define CKCU_MASK_CKOUTSRC      ((u32)0x7 << CKCU_POS_CKOUTSRC)

#define CKCU_POS_PLLSRC         8
#define CKCU_MASK_PLLSRC        ((u32)0x1 << CKCU_POS_PLLSRC)

#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_POS_USBPLLSRC      9
#define CKCU_MASK_USBPLLSRC     ((u32)0x1 << CKCU_POS_USBPLLSRC)

#define CKCU_POS_USBSRC         10
#define CKCU_MASK_USBSRC        ((u32)0x1 << CKCU_POS_USBSRC)
#endif

#define CKCU_POS_CKREFPRE       11
#define CKCU_MASK_CKREFPRE      ((u32)0x1F << CKCU_POS_CKREFPRE)

/* GCCR bit field definition                                                                                */
#define CKCU_POS_SW             0
#define CKCU_MASK_SW            ((u32)0x7 << CKCU_POS_SW)

#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_POS_USBPLLEN       3
#define CKCU_MASK_USBPLLEN      ((u32)0x1 << CKCU_POS_USBPLLEN)
#endif

#define CKCU_POS_LSISTOP        4
#define CKCU_MASK_LSISTOP       ((u32)0x1 << CKCU_POS_LSISTOP)

#define CKCU_POS_LSESTOP        5
#define CKCU_MASK_LSESTOP       ((u32)0x1 << CKCU_POS_LSESTOP)

#define CKCU_POS_PLLEN          9
#define CKCU_MASK_PLLEN         ((u32)0x1 << CKCU_POS_PLLEN)

#define CKCU_POS_HSEEN          10
#define CKCU_MASK_HSEEN         ((u32)0x1 << CKCU_POS_HSEEN)

#define CKCU_POS_HSIEN          11
#define CKCU_MASK_HSIEN         ((u32)0x1 << CKCU_POS_HSIEN)

#define CKCU_POS_CKMEN          16
#define CKCU_MASK_CKMEN         ((u32)0x1 << CKCU_POS_CKMEN)

#define CKCU_POS_PSRCEN         17
#define CKCU_MASK_PSRCEN        ((u32)0x1 << CKCU_POS_PSRCEN)

/* PLLCFGR bit field definition                                                                             */
#define CKCU_POS_POTD           21
#define CKCU_MASK_POTD          ((u32)0x3 << CKCU_POS_POTD)

#define CKCU_POS_PFBD           23
#define CKCU_MASK_PFBD          ((u32)0x0F << CKCU_POS_PFBD)

/* PLLCR bit field definition                                                                               */
#define CKCU_POS_PLLBYPASS      31
#define CKCU_MASK_PLLBYPASS     ((u32)0x1 << CKCU_POS_PLLBYPASS)

/* APBCFGR bit field definition                                                                             */
#define CKCU_POS_ADC0DIV        16
#define CKCU_MASK_ADC0DIV       ((u32)0x7 << CKCU_POS_ADC0DIV)

#if (LIBCFG_ADC1)
#define CKCU_POS_ADC1DIV        20
#define CKCU_MASK_ADC1DIV       ((u32)0x7 << CKCU_POS_ADC1DIV)
#endif

#if (LIBCFG_CKCU_LCD_SRC)
#define CKCU_POS_LCDSRC         4
#define CKCU_MASK_LCDSRC        ((u32)0x3 << CKCU_POS_LCDSRC)
#endif

#if (LIBCFG_LCD)
#define CKCU_POS_LCDDIV         8
#define CKCU_MASK_LCDDIV        ((u32)0x7 << CKCU_POS_LCDDIV)
#endif

/* CKST bit field definition                                                                                */
#define CKCU_POS_PLLST          8
#define CKCU_MASK_PLLST         ((u32)0xF << CKCU_POS_PLLST)

#define CKCU_POS_HSEST          16
#define CKCU_MASK_HSEST         ((u32)0x3 << CKCU_POS_HSEST)

#define CKCU_POS_HSIST          24
#define CKCU_MASK_HSIST         ((u32)0x7 << CKCU_POS_HSIST)

#define CKCU_POS_CKSWST         0
#define CKCU_MASK_CKSWST        ((u32)0x7 << CKCU_POS_CKSWST)

/* HSICR bit field definition                                                                               */
#define CKCU_POS_TRIMEN         (0)
#define CKCU_MASK_TRIMEN        ((u32)0x1 << CKCU_POS_TRIMEN)

#define CKCU_POS_ATCEN          (1)
#define CKCU_MASK_ATCEN         ((u32)0x1 << CKCU_POS_ATCEN)

#define CKCU_POS_TMSEL          (4)
#define CKCU_MASK_TMSEL         ((u32)0x1 << CKCU_POS_TMSEL)

#define CKCU_POS_REFCLKSEL      (5)
#define CKCU_MASK_REFCLKSEL     ((u32)0x3 << CKCU_POS_REFCLKSEL)

#define IS_GAINMODE(GanMode)    ((GanMode == CKCU_HSE_LOW_GAIN_MODE) || \
                                 (GanMode == CKCU_HSE_MEDIUM_LOW_GAIN_MODE)|| \
                                 (GanMode == CKCU_HSE_MEDIUM_HIGH_GAIN_MODE)|| \
                                 (GanMode == CKCU_HSE_HIGH_GAIN_MODE))

