ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ckcu.c
#if (LIBCFG_CKCU_LSI_TRIM)

/* HSICR bit field definition                                                                               */
#define CKCU_POS_LSCLKSEL       (8)
#define CKCU_MASK_LSCLKSEL      ((u32)0x1 << CKCU_POS_LSCLKSEL)

/* LSITCR bit field definition                                                                              */
#define CKCU_POS_PTKEY          (16)
#define CKCU_MASK_PTKEY         ((u32)0xFFFF << CKCU_POS_PTKEY)
#define CKCU_POS_LSITRIMEN      (8)
#define CKCU_MASK_LSITRIMEN     ((u32)0x1 << CKCU_POS_LSITRIMEN)
#define CKCU_POS_LSITRIM        (0)
#define CKCU_MASK_LSITRIM       ((u32)0x7F << CKCU_POS_LSITRIM)

#define CKCU_LSITCR_KEY         (0x9B830000)

#define CKCU_HSIATCR_COUNT_PRE_REFCLK_BY_LSI                  (HSI_VALUE / 1000)

#endif

/**
  * @}
  */

/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Private_Macro CKCU private macros
  * @{
  */
#define CKCU_BF_WRITE(Reg, Mask, Pos, WriteValue)   (Reg = ((Reg & ~((u32)Mask)) | ((u32)WriteValue << Pos)))
#define CKCU_BF_READ(Reg, Mask, Pos)                ((Reg & (u32)Mask) >> Pos)
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @addtogroup CKCU_Exported_Functions CKCU exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the CKCU registers to the reset values.
 * @retval None
 ************************************************************************************************************/
void CKCU_DeInit(void)
{
  /* Reset system clock                                                                                     */
  CKCU_HSICmd(ENABLE);
  while (CKCU_GetClockReadyStatus(CKCU_FLAG_HSIRDY) == RESET);
  CKCU_SysClockConfig(CKCU_SW_HSI);

  #if (LIBCFG_CKCU_USB_PLL)
  HT_CKCU->GCFGR = 0x00000302;                   /* Reset value of GCFGR                                    */
  #else
  HT_CKCU->GCFGR = 0x00000102;                   /* Reset value of GCFGR                                    */
  #endif
  HT_CKCU->GCCR = 0x00000803;                    /* Reset value of GCCR                                     */
  HT_CKCU->GCIR = 0x000000FF;                    /* Clear all interrupt flags                               */

  #if (!LIBCFG_NO_PLL)
  HT_CKCU->PLLCR = 0;                            /* Reset value of PLLCR                                    */
  #endif
  HT_CKCU->AHBCFGR = 0;                          /* Reset value of AHBCFGR                                  */
  HT_CKCU->AHBCCR = 0x00000065;                  /* Reset value of AHBCCR                                   */
  HT_CKCU->APBCFGR = 0x00010000;                 /* Reset value of APBCFGR                                  */
  HT_CKCU->APBCCR0 = 0;                          /* Reset value of APBCCR0                                  */
  HT_CKCU->APBCCR1 = 0;                          /* Reset value of APBCCR1                                  */
  HT_CKCU->APBPCSR0 = 0;                         /* Reset value of APBPCSR0                                 */
  HT_CKCU->APBPCSR1 = 0;                         /* Reset value of APBPCSR1                                 */
  HT_CKCU->HSICR = 0;                            /* Reset value of HSICR                                    */

  #if (LIBCFG_CKCU_HSIRDYCR)
  HT_CKCU->HSIRDYCR = 0;                         /* Reset value of HSIRDYCR                                 */
  #endif

  #if (LIBCFG_CKCU_LSI_TRIM)
  HT_CKCU->LSITCR  = CKCU_LSITCR_KEY;            /* Disable the LSITCR register write protection            */
  HT_CKCU->LSITCR  = 0;                          /* LSITRIMEN = 0 will reset the LSITRIM as default value,  */
                                                 /* this line also set the PTKEY = 0 to enable the write    */
                                                 /* protection function                                     */
  #endif

  HT_CKCU->MCUDBGCR = 0;                         /* Reset value of MCUDBGCR                                 */
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the external high speed oscillator (HSE).
 * @note  HSE can not be stopped if it is used by system clock or PLL.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_HSECmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_HSEEN, CKCU_POS_HSEEN, Cmd);
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the internal high speed oscillator (HSI).
 * @note  HSI can not be stopped if it is used by system clock or PLL.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_HSICmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_HSIEN, CKCU_POS_HSIEN, Cmd);
}

#if (!LIBCFG_NO_PLL)
/*********************************************************************************************************//**
 * @brief Enable or Disable the PLL clock.
 * @note  PLL can not be stopped if it is used by system clock or CK_REF.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_PLLCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_PLLEN, CKCU_POS_PLLEN, Cmd);
}
#endif

