ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_ckcu.c
/*********************************************************************************************************//**
 * @brief Do the LSI Manual Trim by HSI function and check it is ready or not.
 * @param ErrorCount: The target error count (accuracy = ErrorCount/8000).
 *   This parameter can be set manual or be one of the following define:
 *     @arg   CKCU_LSITRIM_ACCURACY_0P0 : Margin of error +-0.0%
 *     @arg   CKCU_LSITRIM_ACCURACY_0P5 : Margin of error +-0.5%
 *     @arg   CKCU_LSITRIM_ACCURACY_1P0 : Margin of error +-1.0%
 *     @arg   CKCU_LSITRIM_ACCURACY_1P5 : Margin of error +-1.5%
 *     @arg   CKCU_LSITRIM_ACCURACY_2P0 : Margin of error +-2.0%
 * @retval TRUE or FALSE
 * @note  The HSIATCR is updated every 2 ms. It is recommended to use a timer to call the
 *        "CKCU_LSIManualTrimIsReady()" >= 2 ms.
 ************************************************************************************************************/
bool CKCU_LSIManualTrimIsReady(u32 ErrorCount)
{
  u32 atCntrMax;
  u32 atCntrMin;
  bool isReady = TRUE;

  /* Get HSI Auto trimming counter.                                                                         */
  u32 cntr = HT_CKCU->HSIATCR;

  /* Get LSI manual trimming counter.                                                                       */
  u32 LSICurrentTrimValue =  HT_CKCU->LSITCR & CKCU_MASK_LSITRIM;

  if (cntr == 0)
  {
    return FALSE;
  }

  /* Calculate the range of margin of error for LSI trimming counter.                                       */
  atCntrMax = CKCU_HSIATCR_COUNT_PRE_REFCLK_BY_LSI + ErrorCount;
  atCntrMin = CKCU_HSIATCR_COUNT_PRE_REFCLK_BY_LSI - ErrorCount;

  /* Modify LSI trim value                                                                                  */
  if (cntr < atCntrMin)
  {
    LSICurrentTrimValue++;   /* trimming counter + 1 = slower freq                                          */
    isReady = FALSE;
  }
  else if (cntr > atCntrMax)
  {
    LSICurrentTrimValue--;   /* trimming counter - 1 = faster freq                                          */
    isReady = FALSE;
  }

  if ((isReady == FALSE) && (LSICurrentTrimValue <= CKCU_MASK_LSITRIM))
  {
    /* Disable write protection                                                                             */
    HT_CKCU->LSITCR = CKCU_LSITCR_KEY | (HT_CKCU->LSITCR & (~(CKCU_MASK_PTKEY)));

    /* Set the LSI new trimming value                                                                       */
    HT_CKCU->LSITCR = CKCU_MASK_LSITRIMEN | LSICurrentTrimValue;
  }

  return isReady;
}
#endif

#if (LIBCFG_CKCU_HSIRDYCR)
/*********************************************************************************************************//**
 * @brief Set HSI Ready Counter Value.
 * @param Value: 0x0~0x1F.
 * @retval None
 ************************************************************************************************************/
void CKCU_SetHSIReadyCounter(u8 Value)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_COUNTER_VALUE(Value));

  HT_CKCU->HSIRDYCR = ((HT_CKCU->HSIRDYCR) & (~(0x1F))) | Value;
}
#endif

/*********************************************************************************************************//**
 * @brief Set HSE Gain Mode.
 * @param GanMode: Specify the gain mode of HSE.
 *        This parameter can be:
 *        @arg CKCU_HSE_LOW_GAIN_MODE         : HSE low gain mode
 *        @arg CKCU_HSE_MEDIUM_LOW_GAIN_MODE  : HSE medium low gain mode
 *        @arg CKCU_HSE_MEDIUM_HIGH_GAIN_MODE : HSE medium high gain mode
 *        @arg CKCU_HSE_HIGH_GAIN_MODE        : HSE high gain mode
 * @retval None
 ************************************************************************************************************/
void CKCU_SetHSEGainMode(u32 GanMode)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GAINMODE(GanMode));

  HT_CKCU->GCCR = (HT_CKCU->GCCR & ~(0x1100)) | GanMode;
}

#if (LIBCFG_CKCU_LSI_LSE_STOP)
/*********************************************************************************************************//**
 * @brief Enable or Disable the LSI stop function in the core power domain.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_LSIStopCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_LSISTOP, CKCU_POS_LSISTOP, Cmd);
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the LSE stop function in the core power domain.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_LSEStopCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_LSESTOP, CKCU_POS_LSESTOP, Cmd);
}
#endif

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
